In [3]:
import os
import numpy as np 
import pandas as pd

import mysql.connector
from mysql.connector import Error

In [2]:
connection = mysql.connector.connect(
        host='127.0.0.1',          # Host Name
        database='sql_tutorial',   # Schemas in MySQL a.k.a Database
        user='root',               # Username
        password='****')     # Password when connect to MySQL

cursor = connection.cursor()

cursor.execute("SELECT * FROM student;") # use sql in execute() function.
cursor.fetchall() # Print all Datapoint.

# ***Lambda Apply Custom Function***

    - In Python, we can use df.apply(lambda x : function(x)) to conduct customize transformation

In [6]:
student_sql_df = pd.read_sql_query("SELECT * FROM student;",connection)
student_sql_df

   student_id name major  score
0           1   小子    英語     20
1           2   小光    英語     30
2           3   小志    化學     40
3           4   小綠    英語     90
4           5   小美    英語     60
5           6   小美    化學     60

In [14]:
def score_classifiction(score):

    if score < 60:
        return "Fail..."

    elif score >= 60 & score < 80:
        return "Good~"
    
    elif score > 80:
        return "Excellent"
    
    else:
        return "Unclear"


student_sql_df['mynote'] = student_sql_df.apply(lambda x: score_classifiction(x['score']),axis=1)
student_sql_df

   student_id name major  score   mynote
0           1   小子    英語     20  Fail...
1           2   小光    英語     30  Fail...
2           3   小志    化學     40  Fail...
3           4   小綠    英語     90    Good~
4           5   小美    英語     60    Good~
5           6   小美    化學     60    Good~

    - In MySQL, we can also built customize function and utlize when we need it.

<img src="/Users/chen-lichiang/Desktop/SQL/Module/SQL Function Construction.png" alt="Getting started" width="600" height="400"/>

In [16]:
pd.read_sql_query(
    "SELECT *,gradeitem(`student`.`score`) as `mynote` FROM student;"
    ,connection)

   student_id name major  score     mynote
0           1   小子    英語     20    Fail...
1           2   小光    英語     30    Fail...
2           3   小志    化學     40    Fail...
3           4   小綠    英語     90  Excellent
4           5   小美    英語     60      Good~
5           6   小美    化學     60      Good~